

hiragana_dict = { 	  'あ' : 'a'  , 'い' : 'i / ee' , 'う' : 'u / ooo' , 'え' : 'e / ae' , 'お' : 'o',
					  'か' : 'ka' , 'き' : 'ki' , 'く' : 'ku' , 'こ' : 'ko' , 'け' : 'ke',
					  'が' : 'ga' , 'ぎ' : 'gi' , 'ぐ' : 'gu' , 'げ' : 'ge' , 'ご' : 'go',
					  'さ' : 'sa' , 'し' : 'shi', 'す' : 'su' , 'せ' : 'se' , 'そ' : 'so',
					  'た' : 'ta' , 'ち' : 'chi', 'つ' : 'tsu', 'て' : 'te' , 'と' : 'to',
					  'だ' : 'da' , 'ぢ' : 'ji' , 'づ' : 'zu' , 'で' : 'de' , 'ど' : 'do',
					  'な' : 'na' , 'に' : 'ni' , 'ぬ' : 'nu' , 'ね' : 'ne' , 'の' : 'no',
					  'は' : 'ha' , 'ひ' : 'hi' , 'ふ' : 'fu' , 'へ' : 'he' , 'ほ' : 'ho',
					  'ぶ' : 'bu' ,
					  'ま' : 'ma' , 'み' : 'mi' , 'む' : 'mu' , 'め' : 'me' , 'も' : 'mo',
					  'や' : 'ya' , 'ゆ' : 'yu' , 'よ' : 'yo' ,
					  'ら' : 'la/ra' , 'り' : 'li/ri' , 'る' : 'lu/ru' , 'れ' : 'le/re' , 'ろ' : 'lo/ro' ,
					  'わ' : 'wa', 'を' : 'oh' , 'ん' : 'n'
				}



hiragana_vocab_dict = {'あ' :'aa'  , 'い' : 'i' , 'う' : 'u'  , 'え' : 'e'  , 'お' : 'oo',
					  'か' : 'ka' , 'き' : 'ki' , 'く' : 'ku' , 'こ' : 'ko' , 'け' : 'ke',
					  'が' : 'ga' , 'ぎ' : 'gi' , 'ぐ' : 'gu' , 'げ' : 'ge' , 'ご' : 'go',
					  'さ' : 'sa' , 'し' : 'shi', 'す' : 'su' , 'せ' : 'se' , 'そ' : 'so',
					  'ぜ' : 'ze' ,
					  'た' : 'ta' , 'ち' : 'chi', 'つ' : 'tsu', 'て' : 'te' , 'と' : 'to',
					  'だ' : 'da' , 'ぢ' : 'ji' , 'づ' : 'zu' , 'で' : 'de' , 'ど' : 'do',
					  'な' : 'na' , 'に' : 'ni' , 'ぬ' : 'nu' , 'ね' : 'ne' , 'の' : 'no',
					  'は' : 'ha' , 'ひ' : 'hi' , 'ふ' : 'fu' , 'へ' : 'he' , 'ほ' : 'ho',
					  'ぶ' : 'bu' ,
					  'ま' : 'ma' , 'み' : 'mi' , 'む' : 'mu' , 'め' : 'me' , 'も' : 'mo',
					  'や' : 'ya' , 'ゆ' : 'yu' , 'よ' : 'yo' ,
					  'ら' : 'ra' , 'り' : 'ri' , 'る' : 'ru' , 'れ' : 're' , 'ろ' : 'ro' ,
					  'わ' : 'wa' , 'を' : 'oh' , 'ん' : 'n'					  
					}
